# EngagementBiggerThanLengthWarning Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarCouplerFailures..::..EngagementBiggerThanLengthWarning Property
BuiltInFailures..::..RebarCouplerFailures Class See Also
---
This is used to post warning. The sum of bar engagements is greater than the total coupler length.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId EngagementBiggerThanLengthWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EngagementBiggerThanLengthWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ EngagementBiggerThanLengthWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarCouplerFailures Class
Autodesk.Revit.DB Namespace